lib/soap-templates/GetLocations.hbs

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:job="http://jobboard.webservice.madgex.co.uk">
   <soapenv:Header/>
   <soapenv:Body>
      <job:GetLocations>
         <job:searchPrefix>{{prefix}}</job:searchPrefix>
      </job:GetLocations>
   </soapenv:Body>
</soapenv:Envelope>